apache/nuttx/arch/risc-v/src/ch32v/ch32v_serial.c
/****************************************************************************
 * arch/risc-v/src/ch32v/ch32v_serial.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/serial/serial.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/tioctl.h>

#include "ch32v_lowputc.h"
#include "ch32v_gpio.h"

//#include "hardware/ch32v_uart.h"
//#include "hardware/ch32v_glb.h"
#include "riscv_internal.h"
// #include "ch32v_config.h"
#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Select UART parameters for the selected console */

#ifdef HAVE_SERIAL_CONSOLE
#if defined(CONFIG_UART0_SERIAL_CONSOLE)
#define CH32V_CONSOLE_IDX    0
#define CH32V_CONSOLE_BAUD   CONFIG_UART0_BAUD
#define CH32V_CONSOLE_BITS   CONFIG_UART0_BITS
#define CH32V_CONSOLE_PARITY CONFIG_UART0_PARITY
#define CH32V_CONSOLE_2STOP  CONFIG_UART0_2STOP
#define CH32V_CONSOLE_TX     GPIO_UART0_TX
#define CH32V_CONSOLE_RX     GPIO_UART0_RX
#define HAVE_UART
#elif defined(CONFIG_UART1_SERIAL_CONSOLE)
#define CH32V_CONSOLE_IDX    1
#define CH32V_CONSOLE_BAUD   CONFIG_UART1_BAUD
#define CH32V_CONSOLE_BITS   CONFIG_UART1_BITS
#define CH32V_CONSOLE_PARITY CONFIG_UART1_PARITY
#define CH32V_CONSOLE_2STOP  CONFIG_UART1_2STOP
#define CH32V_CONSOLE_TX     GPIO_UART1_TX
#define CH32V_CONSOLE_RX     GPIO_UART1_RX
#define HAVE_UART
#endif
#endif /* HAVE_CONSOLE */

/* If we are not using the serial driver for the console, then we still must
 * provide some minimal implementation of up_putc.
 */

#ifdef USE_SERIALDRIVER

/* Which UART with be tty0/console and which tty1?  The console will always
 * be ttyS0.  If there is no console then will use the lowest numbered UART.
 */

#ifdef HAVE_SERIAL_CONSOLE
#if defined(CONFIG_UART0_SERIAL_CONSOLE)
#define CONSOLE_DEV g_uart0port /* UART0 is console */
#define TTYS0_DEV   g_uart0port /* UART0 is ttyS0 */
#undef TTYS1_DEV                /* No ttyS1 */
#define SERIAL_CONSOLE 1
#elif defined(CONFIG_UART1_SERIAL_CONSOLE)
#define CONSOLE_DEV g_uart1port /* UART0 is console */
#error "I'm confused... Do we have a serial console or not?"
#endif
#else
#undef CONSOLE_DEV /* No console */
#undef CONFIG_UART0_SERIAL_CONSOLE
#if defined(CONFIG_CH32V_UART0)
#define TTYS0_DEV g_uart0port /* UART0 is ttyS0 */
#undef TTYS1_DEV              /* No ttyS1 */
#define SERIAL_CONSOLE 1
#else
#undef TTYS0_DEV
#undef TTYS1_DEV
#endif
#endif

/* Common initialization logic will not not know that the all of the UARTs
 * have been disabled.  So, as a result, we may still have to provide
 * stub implementations of riscv_earlyserialinit(), riscv_serialinit(), and
 * up_putc().
 */

#ifdef HAVE_UART_DEVICE

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct ch32v_uart_s
{
  uint8_t              irq;      /* IRQ associated with this UART */
  struct uart_config_s config;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Serial driver methods */

static int  ch32v_setup(struct uart_dev_s *dev);
static void ch32v_shutdown(struct uart_dev_s *dev);
static int  ch32v_attach(struct uart_dev_s *dev);
static void ch32v_detach(struct uart_dev_s *dev);
static int  ch32v_ioctl(struct file *filep, int cmd, unsigned long arg);
static int  ch32v_receive(struct uart_dev_s *dev, unsigned int *status);
static void ch32v_rxint(struct uart_dev_s *dev, bool enable);
static bool ch32v_rxavailable(struct uart_dev_s *dev);
static void ch32v_send(struct uart_dev_s *dev, int ch);
static void ch32v_txint(struct uart_dev_s *dev, bool enable);
static bool ch32v_txready(struct uart_dev_s *dev);
static bool ch32v_txempty(struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct uart_ops_s g_uart_ops =
{
  .setup       = ch32v_setup,
  .shutdown    = ch32v_shutdown,
  .attach      = ch32v_attach,
  .detach      = ch32v_detach,
  .ioctl       = ch32v_ioctl,
  .receive     = ch32v_receive,
  .rxint       = ch32v_rxint,
  .rxavailable = ch32v_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol = NULL,
#endif
  .send    = ch32v_send,
  .txint   = ch32v_txint,
  .txready = ch32v_txready,
  .txempty = ch32v_txempty,
};

/* I/O buffers */

#ifdef CONFIG_CH32V_UART0
static char g_uart0rxbuffer[CONFIG_UART0_RXBUFSIZE];
static char g_uart0txbuffer[CONFIG_UART0_TXBUFSIZE];

static struct ch32v_uart_s g_uart0priv =
{
  .irq      = CH32V_IRQ_UART0,
  .config =
    {
      .idx       = 0,
      .baud      = CONFIG_UART0_BAUD,
      .parity    = CONFIG_UART0_PARITY,
      .data_bits = CONFIG_UART0_BITS,
      .stop_bits = CONFIG_UART0_2STOP,

